*Работу выполнила Иванова Ксения ТРПО24-5*
## Как использовать
Через консоль вызовите следующую команду:
```bash
python <путь\к\main.py> --path="<путь к файлу .csv>"
```
## Импорты
```Python
import numpy as np # основная библиотека
import pandas as pd # для более красивых выводов
```
## Задание 1
Файл `data.csv` содержит информацию об идентификаторе рецепта, времени его выполнения в минутах и количестве необходимых ингредиентов. Считайте данные из этого файла в виде массива `numpy` типа `int32`, используя `np.loadtxt`. Выведите на экран первые 5 строк массива.
```Python
def open_file(path):
	data = np.loadtxt(path, skiprows=1, delimiter=',', dtype='int32')
	return data

def first_task(data):
	df = pd.DataFrame(data[:5])
	print("Первые 5 рецептов:\n", df)
```
## Задание 2
Вычислите среднее значение, минимум, максимум и медиану по каждому из столбцов, кроме первого.
```Python
def second_task(data):
	stats = {
	'Column 1': [data[:, 1].mean(), data[:, 1].min(), data[:, 1].max(), np.median(data[:, 1])],
	'Column 2': [data[:, 2].mean(), data[:, 2].min(), data[:, 2].max(), np.median(data[:, 2])]
	}
	df = pd.DataFrame(stats, index=['Mean', 'Min', 'Max', 'Median'])
	print(df)
```
## Задание 3
Ограничьте сверху значения продолжительности выполнения рецепта значением квантиля $q_{0.75}$.
```Python
def third_task(data):
	q_75 = np.quantile(data[:, 1], 0.75)
	filtered_data = data[data[:, 1] <= q_75]
	df = pd.DataFrame(filtered_data)
	print(f"Квантиль: {q_75}")
	print("Отсортированная таблица:")
	print(df)
```
## Задание 4
Посчитайте, для скольких рецептов указана продолжительность, равная нулю. Замените для таких строк значение в данном столбце на 1.
```Python
def fourth_task(data):
	print("Количество рецептов с продолжительностью ноль:", len(data[data[:, 1] == 0]))
	data[data[:, 1] == 0, 1] = 1
	df = pd.DataFrame(data[data[:, 1] == 1])
	print("\nРецепты с измененной продолжительностью:\n", df)
```
## Задание 5
Посчитайте, сколько уникальных рецептов находится в датасете.
```Python
def fifth_task(data):
	print("Колиечество уникальный рецептов:", len(np.unique(data, axis=1)))
```
## Задание 6 
Сколько и каких различных значений кол-ва ингредиентов присутвует в рецептах из датасета?
```Python
def sixth_task(data):
	print("Количество уникальных количеств ингредиентов:", len(np.unique(data[:, 2])))
	df = pd.DataFrame(np.unique(data[:, 2]), columns=['Уникальное количество ингредиентов'])
	print("\nУникальное количество ингредиентов:\n", df)
```
## Задание 7
Создайте версию массива, содержащую информацию только о рецептах, состоящих не более чем из 5 ингредиентов.
```Python
def seventh_task(data):
	df = pd.DataFrame(data[data[:, 2] <= 5])
	print("Рецепты состоящие из 5 и меньше ингредиентов:\n", df)
```
## Задание 8 
Для каждого рецепта посчитайте, сколько в среднем ингредиентов приходится на одну минуту рецепта. Найдите максимальное значение этой величины для всего датасета.
```Python
def eighth_task(data):
	data[data[:, 1] == 0, 1] = 1 # что бы не делить на 0
	print("Максимальное значение отношения ингредиентов на минуту:", np.max(data[:, 2] / data[:, 1]))
	for i in range(len(data)):
		print(f"Рецепт: {data[i, 0]}, Значение: {data[i, 2] / data[i, 1]}")
```
## Задание 9
Вычислите среднее количество ингредиентов для топ-100 рецептов с наибольшей продолжительностью.
```Python
def ninth_task(data):
	top_100 = (data[data[:, 1].argsort()][-100:])
	print("Среднее значение ингредиентов топ 100 рецептов:", top_100[:, 2].mean())
```
## Задание 10
Выберите случайным образом и выведите информацию о 10 различных рецептах.
```Python
def tenth_task(data):
	df = pd.DataFrame(data[np.random.randint(0, len(data), (10))])
	print("Информация о 10 рандомных рецептах:\n", df)
```
## Задание 11
Выведите процент рецептов, кол-во ингредиентов в которых меньше среднего.
```Python
def eleventh_task(data):
	print("Процент рецептов с количеством ингредиентов меньше среднего: "\
	, len(data[data[:, 2] < data[:, 2].mean()]) / len(data) * 100, "%", sep="")
```
## Задание 12
Назовем "простым" такой рецепт, длительность выполнения которого не больше 20 минут и кол-во ингредиентов в котором не больше 5. Создайте версию датасета с дополнительным столбцом, значениями которого являются 1, если рецепт простой, и 0 в противном случае.
```Python
def twelfth_task(data):
	a = np.array([(data[:, 1] <= 20)] and [(data[:, 2] <= 5)], dtype='int32').transpose()
	data3 = np.append(data, a, axis=1)
	df = pd.DataFrame(data3)
	print("Новая таблица:\n", df)
```
## Задание 13
Выведите процент "простых" рецептов в датасете.
```Python
def thirteenth_task(data):
	a = np.array([(data[:, 1] <= 20)] and [(data[:, 2] <= 5)], dtype='int32').transpose()
	data3 = np.append(data, a, axis=1)
	print("Количество простых рецептов: ", sum(data3[:, 3]) / len(data3) * 100, "%", sep="")
```
## Задание 14
Разделим рецепты на группы по следующему правилу. Назовем рецепты короткими, если их продолжительность составляет менее 10 минут; стандартными, если их продолжительность составляет более 10, но менее 20 минут; и длинными, если их продолжительность составляет не менее 20 минут. Создайте трехмерный массив, где нулевая ось отвечает за номер группы (короткий, стандартный или длинный рецепт), первая ось - за сам рецепт и вторая ось - за характеристики рецепта. Выберите максимальное количество рецептов из каждой группы таким образом, чтобы было возможно сформировать трехмерный массив. Выведите форму полученного массива.
```Python
def fourteenth_task(data):
	short_recipes = data[data[:, 1] < 10]
	standard_recipes = data[(data[:, 1] >= 10) & (data[:, 1] < 20)]
	long_recipes = data[data[:, 1] >= 20]
	
	max_index = max(data[:, 0]) + 1
	arr = np.empty((3, max_index, 2), dtype='int32')
	
	arr[0, short_recipes[:, 0], :] = short_recipes[:, 1:]
	arr[1, standard_recipes[:, 0], :] = standard_recipes[:, 1:]
	arr[2, long_recipes[:, 0], :] = long_recipes[:, 1:]
	print("Форма массива:", arr.shape)
```
